"use client";
import { jsx as _jsx, jsxs as _jsxs, Fragment as _Fragment } from "react/jsx-runtime";
import { Link } from "@heroui/link";
import { Spinner } from "@heroui/spinner";
const funnyMessages = [
    "Качка може ходити, плавати і літати!",
    "Качку породи 'українська сіра' створювали на базі Українського НДІ птахівництва.",
    "Качки мають водонепроникне пір'я, що допомагає їм плавати.",
    "Качки можуть занурюватися під воду, щоб шукати їжу.",
    "Качки мають великі лапки, які допомагають їм рухатися по землі.",
    "Качки є соціальними тваринами і часто живуть у великих групах.",
    "Качки мають великі крила, які допомагають їм літати.",
    "Крякання качок не створює ехо, і ніхто точно не знає чому.",
    'У Бостоні щорічно проводять "качиний парад", де птахи ходять вулицями міста.',
    "Качки можуть пірнати на глибину до 6 метрів, щоб вполювати рибу.",
    "У качок є три повіки на кожному оці для захисту під водою.",
    "У 1940-х роках у США качкам будували тунелі під дорогами.",
    "Качки можуть спати з одним відкритим оком, щоб стежити за хижаками.",
    "У давньому Китаї качок часто зображували на кераміці як символ вірності.",
    "У деяких культурах качки символізують перемогу над драконом — водною стихією.",
    "Качки можуть видавати більше 200 різних звуків для спілкування.",
    "Деякі види качок запам'ятовують маршрути міграції на все життя.",
];
const Loader = ({ progress }) => {
    return (_jsxs("div", { className: "flex flex-col h-full items-center justify-center", children: [_jsx(Spinner, {}), _jsx("p", { className: "mt-2 text-center", suppressHydrationWarning: true, children: funnyMessages[Math.floor(Math.random() * funnyMessages.length)] }), !!progress && (_jsxs(_Fragment, { children: [_jsxs("p", { className: "mt-2 text-center text-sm text-gray-400", suppressHydrationWarning: true, children: ["\u0417\u0430\u0432\u0430\u043D\u0442\u0430\u0436\u0435\u043D\u043D\u044F ", progress, " \u0441\u0442\u043E\u0440\u0456\u043D\u043A\u0438."] }), _jsxs("p", { className: "text-center text-sm text-gray-400 w-80", suppressHydrationWarning: true, children: ["\u0417\u0430\u0432\u0430\u043D\u0442\u0430\u0436\u0435\u043D\u043D\u044F \u0441\u043F\u0438\u0441\u043A\u0456\u0432 \u043D\u0430 \u0431\u0456\u043B\u044C\u0448\u0435 \u043D\u0456\u0436 25,000 \u0435\u043B\u0435\u043C\u0435\u043D\u0442\u0456\u0432 \u043C\u043E\u0436\u0435 \u0437\u0430\u0439\u043C\u0430\u0442\u0438 \u0431\u0430\u0433\u0430\u0442\u043E \u0447\u0430\u0441\u0443. \u0417\u0440\u0443\u0447\u043D\u0456\u0448\u0435 \u0442\u0430 \u0448\u0432\u0438\u0434\u0448\u0435 \u0448\u0443\u043A\u0430\u0442\u0438 \u043A\u043E\u043D\u043A\u0440\u0435\u0442\u043D\u0443 \u0441\u043F\u0440\u0430\u0432\u0443 \u0437\u0430 \u0440\u0435\u043A\u0432\u0456\u0437\u0438\u0442\u0430\u043C\u0438 ", _jsx(Link, { href: "/search", children: "\u043D\u0430 \u0441\u0442\u043E\u0440\u0456\u043D\u0446\u0456 \u043F\u043E\u0448\u0443\u043A\u0443." })] })] }))] }));
};
export default Loader;
